# `Time Series Analysis`

### Chapter 02: Time Series Handling with Pandas

#### `Array and Data Frames`

In [7]:
import numpy as np

x = np.array([1,2,3,4])
print(x)
type(x)

[1 2 3 4]

numpy.ndarray

In [15]:
import pandas as pd

# Series مثال على الـ
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [16]:
# Dataframe  مثال على أطر البيانات
d = {'col1': ["Cake", "Orange", "Eggs"], 'col2': [2, 3, 5], 'col3':[3.5, 4, 10]}
df = pd.DataFrame(data=d)
df

     col1  col2  col3
0    Cake     2   3.5
1  Orange     3   4.0
2    Eggs     5  10.0

In [14]:
d = {'Type': ["Cake", "Orange", "Eggs", "apple", "Fish"], 'Quantity': [2, 3, 5, 4, 5], 'Price':[3.5, 4, 10, 5, 20]}
df = pd.DataFrame(data=d)
df

     Type  Quantity  Price
0    Cake         2    3.5
1  Orange         3    4.0
2    Eggs         5   10.0
3   apple         4    5.0
4    Fish         5   20.0

#### `Dates and time creation using datetime module`

In [17]:
from datetime import datetime, timedelta

# إنشاء تاريخ عشوائي
print('Arbitrary date: ', end=' ')
print(datetime(year=2021, month=4, day=15))

# إنشاء تاريخ وتوقيت عشوائيين
print('Date and time:  ', end=' ')
print(datetime(year=2021, month=4, day=15, hour=8, minute=22, second=43))

# التاريخ والتوقيت الآن
print('Date right now: ', end=' ')
print(datetime.now())

#  استخراج التاريخ التوقيت في الأمس 
print('Date yesterday: ', end=' ')
print(datetime.now() - timedelta(days=1))

Arbitrary date:  2021-04-15 00:00:00
Date and time:   2021-04-15 08:22:43
Date right now:  2022-05-01 08:37:21.923584
Date yesterday:  2022-04-30 08:37:21.923584

#### `Datetime variable methods`

In [19]:
now = datetime.now()
print(f"Current Time: {now}")
print(now.year, now.month, now.day, now.hour, now.minute, now.second)

Current Time: 2022-05-01 08:37:52.348365
2022 5 1 8 37 52

#### `Datetime Ranges `

In [21]:
from datetime import datetime

date_list = [
    datetime(2022, 2, 13),
    datetime(2022, 2, 14),
    datetime(2022, 2, 15) ]

date_list

[datetime.datetime(2022, 2, 13, 0, 0),
 datetime.datetime(2022, 2, 14, 0, 0),
 datetime.datetime(2022, 2, 15, 0, 0)]

In [22]:
import numpy as np

date_list = np.array(['2022-02-13', '2022-02-14', '2022-02-15'], 
                      dtype='datetime64')
date_list

array(['2022-02-13', '2021-02-14', '2021-02-15'], dtype='datetime64[D]')

In [24]:
date_list = np.array(['2022-02-13', '2022-02-14', '2022-02-15'], 
            dtype='datetime64[s]')
date_list

array(['2022-02-13T00:00:00', '2022-02-14T00:00:00',
       '2022-02-15T00:00:00'], dtype='datetime64[s]')

In [31]:

date_list = np.array(['2022-02-13', '2022-02-14', '2022-02-15'], 
            dtype='datetime64[ns]')
date_list

array(['2022-02-13T00:00:00.000000000', '2022-02-14T00:00:00.000000000',
       '2022-02-15T00:00:00.000000000'], dtype='datetime64[ns]')

In [33]:
date_list = np.arange('2022-07-01', '2022-07-10', 
                      dtype='datetime64[D]')
date_list

array(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
       '2022-07-05', '2022-07-06', '2022-07-07', '2022-07-08',
       '2022-07-09'], dtype='datetime64[D]')

In [36]:
import pandas as pd

date_list = pd.date_range(start='2022-07-01', 
                          end='2022-07-10')
date_list

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06', '2022-07-07', '2022-07-08',
               '2022-07-09', '2022-07-10'],
              dtype='datetime64[ns]', freq='D')

In [45]:
date_list = pd.date_range(start='2022-07-01', periods=10, freq='D')
date_list

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06', '2022-07-07', '2022-07-08',
               '2022-07-09', '2022-07-10'],
              dtype='datetime64[ns]', freq='D')

In [46]:
date_list = pd.date_range(start='2022-07-01', periods=10, freq='Y')
date_list

DatetimeIndex(['2022-12-31', '2023-12-31', '2024-12-31', '2025-12-31',
               '2026-12-31', '2027-12-31', '2028-12-31', '2029-12-31',
               '2030-12-31', '2031-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

#### `Get Min(oldest) & Max(newest) dates`

In [48]:
date_list = pd.date_range(start='2022-07-01', periods=10, freq='D')


print(f'Minimum date: {date_list.min()}')
print(f'Maximum date: {date_list.max()}')

Minimum date: 2022-07-01 00:00:00
Maximum date: 2022-07-10 00:00:00

#### `Resampling`

In [61]:
import pandas as pd

df = pd.read_csv('datasets/LTOTALNSA.csv', index_col='DATE', parse_dates=True)
df.head(7)

            LTOTALNSA
DATE
1976-01-01      864.6
1976-02-01      973.3
1976-03-01     1216.1
1976-04-01     1163.2
1976-05-01     1176.1
1976-06-01     1224.9
1976-07-01     1130.1

#### `Resampling : Upesampling`

In [62]:
yearly_totals = df.resample(rule='Y').sum()
yearly_totals.head(7)

            LTOTALNSA
DATE
1976-12-31    12969.8
1977-12-31    14481.9
1978-12-31    14981.0
1979-12-31    13758.4
1980-12-31    11197.5
1981-12-31    10563.6
1982-12-31    10357.3

#### `Resampling : Downsampling`

In [87]:
monthly_totals = yearly_totals.resample(rule='M')
monthly_totals = monthly_totals.interpolate(method='spline', order=3)
monthly_totals.head(10)

               LTOTALNSA
DATE
1976-12-31  12969.800000
1977-01-31  13120.378969
1977-02-28  13254.038620
1977-03-31  13399.044409
1977-04-30  13536.009623
1977-05-31  13673.652110
1977-06-30  13802.696216
1977-07-31  13931.331712
1977-08-31  14054.759973
1977-09-30  14168.848857

#### `Shifting`

In [88]:
df_shift = df.copy()
df_shift['Shift_1'] = df_shift['LTOTALNSA'].shift(1)
df_shift['Shift_2'] = df_shift['LTOTALNSA'].shift(2)
df_shift.head()

            LTOTALNSA  Shift_1  Shift_2
DATE
1976-01-01      864.6      NaN      NaN
1976-02-01      973.3    864.6      NaN
1976-03-01     1216.1    973.3    864.6
1976-04-01     1163.2   1216.1    973.3
1976-05-01     1176.1   1163.2   1216.1

In [90]:
df_shift = df.copy()
df_shift['Shift_Neg1'] = df_shift['LTOTALNSA'].shift(-1)
df_shift['Shift_Neg2'] = df_shift['LTOTALNSA'].shift(-2)
df_shift.tail()

            LTOTALNSA  Shift_Neg1  Shift_Neg2
DATE
2021-11-01   1014.411    1203.993     989.560
2021-12-01   1203.993     989.560    1045.307
2022-01-01    989.560    1045.307    1246.336
2022-02-01   1045.307    1246.336         NaN
2022-03-01   1246.336         NaN         NaN

#### `Rolling`

In [96]:
df_rolling = df.copy()
df_rolling['QuarterRolling'] = df_rolling['LTOTALNSA'].rolling(window=4).mean()
df_rolling['YearRolling'] = df_rolling['LTOTALNSA'].rolling(window=12).mean()
df_rolling.head(15)

            LTOTALNSA  QuarterRolling  YearRolling
DATE
1976-01-01      864.6             NaN          NaN
1976-02-01      973.3             NaN          NaN
1976-03-01     1216.1             NaN          NaN
1976-04-01     1163.2        1054.300          NaN
1976-05-01     1176.1        1132.175          NaN
1976-06-01     1224.9        1195.075          NaN
1976-07-01     1130.1        1173.575          NaN
1976-08-01      994.9        1131.500          NaN
1976-09-01     1024.9        1093.700          NaN
1976-10-01     1103.7        1063.400          NaN
1976-11-01     1062.0        1046.375          NaN
1976-12-01     1036.0        1056.650  1080.816667
1977-01-01      945.0        1036.675  1087.516667
1977-02-01     1065.4        1027.100  1095.191667
1977-03-01     1414.0        1115.100  1111.683333

#### `Differencing`

In [97]:
df_diff = df.copy()

# First order:   973.3 - 864.6 = 108.7
df_diff['Diff_1'] = df_diff['LTOTALNSA'].diff(periods=1)

# Second order: 1216.1 - 864.6 = 351.5
df_diff['Diff_2'] = df_diff['LTOTALNSA'].diff(periods=2)

df_diff.head()

            LTOTALNSA  Diff_1  Diff_2
DATE
1976-01-01      864.6     NaN     NaN
1976-02-01      973.3   108.7     NaN
1976-03-01     1216.1   242.8   351.5
1976-04-01     1163.2   -52.9   189.9
1976-05-01     1176.1    12.9   -40.0

#### `Time Series Visualization`